Revit 2017 API
FormattedTextRun.Italic Property
 Indicates whether this text run uses Italic text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public bool Italic { get; }
Visual Basic
Public ReadOnly Property Italic As Boolean
	Get
Visual C++
public:
property bool Italic {
	bool get ();
}
See Also
FormattedTextRun Class
Autodesk.Revit.DB Namespace